linux/linuxos/VNC.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>VNC</title>
<!-- 2015-03-25 Wed 21:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title">VNC</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. CentOS 6.5安装、启动</a></li>
<li><a href="#sec-2">2. VNCViewer登陆</a></li>
<li><a href="#sec-3">3. 可能出现的问题</a></li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../layout/css/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../layout/css/style.css" />
<script src="../../layout/js/jquery_1.7.1.js"></script>
<script src="../../layout/js/bootstrap_old.js"></script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CentOS 6.5安装、启动</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
yum install tigervnc-server tigervnc
</pre>
<p>
之后vncserver启动，输入2次密码，启动一个display，标号为hostname:后的数字<br/>
</p>
<pre class="example">
[root@node3 .vnc]# vncserver
New 'node3:3 (root)' desktop is node3:3
Starting applications specified in /root/.vnc/xstartup
Log file is /root/.vnc/node3:3.log
</pre>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> VNCViewer登陆</h2>
<div class="outline-text-2" id="text-2">
<p>
Windows上用vncviewer登陆，格式为<br/>
</p>
<pre class="example">
CentOS服务器:display号
</pre>
<p>
Mac可以用Chicken of VNC登陆。<br/>
</p>

<p>
填写host时有两种方法：<br/>
</p>
<ol class="org-ol">
<li>使用真实的IP和端口，例如 192.168.1.111:4901<br/>
</li>
<li>使用IP和display号：例如 host填192.168.1.111，display号填1<br/>
</li>
</ol>
<p>
端口号=4900+display号<br/>
</p>

<p>
如果使用路由器映射则直接使用第一种方法方便：202.120.38.42:50029<br/>
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 可能出现的问题</h2>
<div class="outline-text-2" id="text-3">
<p>
如果CentOS装系统时没有安装图形界面则会出现黑屏：<br/>
</p>
<pre class="example">
yum groupinstall “GNOME Desktop Environment”
</pre>
<p>
之后修改~/.vnc/xstartup最后一行<br/>
</p>
<pre class="example">
# twm &amp;
gnome-session &amp;
</pre>

<p>
首先kill掉之前的display<br/>
</p>
<pre class="example">
vncserver -kill :3
</pre>
<p>
重启服务，重启生成display<br/>
</p>
<pre class="example">
service vncserver restart
vncserver
</pre>
</div>
</div>
</div>
</body>
</html>
